# Cleaning UK stk data
* change to Q1 to Q4

In [17]:
import numpy as np
import pandas as pd
stk_file = 'data/stocks/^FTSE.csv'
df = pd.read_csv(stk_file)
df.columns = ['date', 'price']
df.head()

        date        price
0   3/1/1993  2878.699951
1  3/31/1993  2813.100098
2  4/30/1993  2840.699951
3  5/31/1993  2900.000000
4  6/30/1993  2926.500000

In [18]:
df.date = pd.to_datetime(df['date'])
df = df.set_index("date")
df.head()

                  price
date
1993-03-01  2878.699951
1993-03-31  2813.100098
1993-04-30  2840.699951
1993-05-31  2900.000000
1993-06-30  2926.500000

In [19]:
df = df.resample('QS-JUN').bfill()

In [20]:
df.head()

                  price
date
1993-03-01  2878.699951
1993-06-01  2926.500000
1993-09-01  3171.000000
1993-12-01  3418.399902
1994-03-01  3086.399902

In [21]:
# save to ^FTSE.csv
df.to_csv('^FTSE.csv')

# Fix est file
* match the date

In [26]:
est_file = 'data/estates/uk.csv'
df = pd.read_csv(est_file)
df.date = pd.to_datetime(df.date, format='%Y-%m-%d')
df = df.set_index('date')
df.head()

            price
date
1975-03-31  92841
1975-06-30  87658
1975-09-30  85885
1975-12-31  85408
1976-03-31  83933

In [28]:
df = df.resample('QS-JUN').bfill()
df.head()

            price
date
1975-03-01  92841
1975-06-01  87658
1975-09-01  85885
1975-12-01  85408
1976-03-01  83933

In [29]:
df.to_csv('uk.csv')